FemDesign.Reinforcement.SurfaceReinforcementParameters
shell_rf_params_type
Shell reinforcement parameters

FemDesign.Reinforcement.SurfaceReinforcementParameters.#ctor
Parameterless constructor for serialization.

FemDesign.Reinforcement.SurfaceReinforcementParameters.#ctor(System.Boolean,FemDesign.GuidListType,FemDesign.Reinforcement.Center,FemDesign.Geometry.Vector3d,FemDesign.Geometry.Vector3d)
Private constructor accessed by static methods.

FemDesign.Reinforcement.SurfaceReinforcementParameters.Straight(FemDesign.Shells.Slab,System.Boolean)
Straight reinforcement layout on slab.